//程序设计基础习题集第3章循环程序设计3.1基本练习第77题
//编写程序，输出如下序列的前100项。该序列的第一项为0，第二项为1
//以后的奇数项为其前两项之和，偶数项为其前两项之差

#include<stdio.h>

int main(){
	int n=100;//定义需要输出的项数，设置为100
	int a[n+1];//用来存储该序列的前n项
	int i;//定义该序列元素下标 
	a[0]=0;
	a[1]=1;
	for(i=3;i<=n;++i){
		if(i%2==1){
			//如果是奇数项
			a[i-1]=a[i-2]+a[i-3];//奇数项为其前两项之和 
		}
		else if(i%2==0){
			//如果是偶数项
			a[i-1]=a[i-2]-a[i-3];//偶数项为其前两项之差 
		} 
	}
	
	for(i=0;i<n;++i){
		printf("The nubmer of a[%d] is %d.\n",i+1,a[i]);
		//输出该序列前n项 
	}
	return 0; 
} 
